app/controllers/sessions_controller.rb

  def create_teacher
     @user = User.new(user_params)
     if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "ross morey"], ["email", "ross@mail.com"], ["created_at", "2023-02-26 16:12:21.374829"], ["updated_at", "2023-02-26 16:12:21.374829"], ["password_digest", "[FILTERED]"]]

  def create_session
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "joel@mail.com"], ["LIMIT", 1]]